---
kind: property
id: P:Autodesk.Revit.DB.RoutingPreferenceManager.PreferredJunctionType
source: html/2a9614e7-f286-c797-f512-ba77398a5b87.htm
---
# Autodesk.Revit.DB.RoutingPreferenceManager.PreferredJunctionType Property

The preferred junction type.

## Syntax (C#)
```csharp
public PreferredJunctionType PreferredJunctionType { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: A value passed for an enumeration argument is not a member of that enumeration
- **Autodesk.Revit.Exceptions.DisabledDisciplineException** - When setting this property: None of the following disciplines is enabled: Mechanical Electrical Piping.